app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('Quentin Johnson', 'S1eAxIeOKHjC45o2mM2j', NULL, '2009-12-24 00:21:22', 'e6780420c449670196a5c1cd1270e0c2dad25967e510cb03f64f82bd9a1f0f49739aae335e8c8a5c2c86dcbf1aa559b73133a8989fd8860115a0f574a0fd543e', '_JgkaKP9PlLIKUXIGZ7e', '2009-12-24 00:21:22', 0, NULL, 'h02mXnkH7kG_3b0vO9v2', NULL, '1ba4c541a76a6e5df46b2c674811f60445e4585d1cecf3dbb5bec19324a171aa7b673945b2a545ece13c0c1a4853c00e35ef5e171a4031270cde570b17152096', 0, NULL, 'quentin_9', NULL, 'person9@example.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

DELETE FROM `users` WHERE `id` = 22
---
  def destroy
    @user.destroy

SELECT * FROM `users` WHERE (`users`.`id` = 22)
---
  def find_user
    @user = User.find(params[:id])